install-script.org
#+TITLE: Install Script
#+AUTHOR: Anishka Patel
#+DATE: [2022-08-29 Mon]
#+DESCRIPTION: Org document to create an install script for various dependencies
#+EMAIL: anishka.vpatel@gmail.com
#+PROPERTY: header-args :tangle install-script.sh
#+auto_tangle: t

* Updating cache & packages
#+begin_src bash
#! /usr/bin/bash

# sudo apt update && sudo apt upgrade -y
# sudo dnf update
# sudo apk update
sudo pacman -Syu --noconfirm
#+end_src
* Package Managers
#+begin_src bash
sudo pacman -S flatpak appimagelauncher yay --noconfirm
#+end_src
** Homebrew
#+begin_src bash
/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#+end_src
* System Utilities
#+begin_src bash
sudo pacman -S htop glances --noconfirm
# sudo pacman -S sysstat ifstat --noconfirm
#+end_src
** System info utilities
#+begin_src bash
sudo pacman -S neofetch --noconfirm
#+end_src
** Finding utilities
#+begin_src bash
sudo pacman -S fd mlocate --noconfirm
#+end_src
** Disk Management Utilities
#+begin_src bash
sudo pacman -S ncdu df du --noconfirm
#+end_src
* Source Code Management
#+begin_src bash
sudo -S git github-cli --noconfirm
#+end_src
* Desktop Manager
#+begin_src bash
sudo pacman -S sddm --noconfirm
#+end_src
* Desktop Environment
** KDE Plasma Desktop
#+begin_src bash
sudo pacman -S plasma-desktop --noconfirm
#+end_src
** Other Plasma Utilities
#+begin_src bash
sudo pacman -S plasma-nm plasma-pa kdeplasma-addons kde-gtk-config --noconfirm
#+end_src
** KDE File manager
#+begin_src bash
sudo pacman -S doplhin --noconfirm
#+end_src
** KDE Battery manager
#+begin_src bash
sudo pacman -S powerdevil --noconfirm
#+end_src
** ARCH GUI Package manager
#+begin_src bash
sudo pacman -S pamac --noconfirm
#+end_src
** KDE Virtual consoles
#+begin_src bash
sudo pacman -S konsole yakuake --noconfirm
#+end_src
** KDE Package Explorer
#+begin_src bash
sudo pacman -S discover --noconfirm
#+end_src
* Fonts
#+begin_src bash
sudo yay -S nerd-fonts-complete
# sudo pacman -S ttf-cascadia-code ttf-dejavu ttf-fira-code ttf-roboto ttf-roboto-mono noto-fonts noto-fonts-emoji terminus-font --noconfirm
#+end_src
* Shells
#+begin_src bash
# sudo pacman -S sh bash --noconfirm
sudo pacman -S zsh fish --noconfirm
#+end_src
* Firewall
#+begin_src bash
sudo pacman -S firewall --noconfirm
# sudo pacman -S ufw gufw --noconfirm
#+end_src
* Text Editors
#+begin_src bash
sudo pacman -S neovim emacs --noconfirm
# sudo pacman -S vi vim --noconfirm
#+end_src
* Web Browsers
#+begin_src bash
sudo pacman -S firefox --noconfirm
sudo flatpak install com.google.Chrome -y
# sudo pacman -S brave chromium --noconfirm
# sudo yay -S google.chrome --noconfirm
#+end_src
* Languages, Runtime & Development Environment
** Most Important
#+begin_src bash
sudo pacman -S python nodejs rust go --noconfirm
#+end_src
** Python
#+begin_src bash
sudo pacman -S python ipython --noconfirm
#+end_src
** Node
#+begin_src bash
sudo pacman -S nodejs --noconfirm
#+end_src
** Rust
#+begin_src bash
sudo pacman -S rustup rust-analyzer --noconfirm
#+end_src
** Lua
#+begin_src bash
sudo pacman -S lua luarocks luajit --noconfirm
#+end_src
** Dotnet
#+begin_src bash
sudo pacman -S dotnet-host dotnet-sdk dotnet-runtime dotnet-targeting-pack --noconfirm
#+end_src
** Mono
#+begin_src bash
sudo pacman -S mono mono-addins --noconfirm
#+end_src
** Go
#+begin_src bash
sudo pacman -S go --noconfirm
#+end_src
* Game & 3d Modelling
#+begin_src bash
sudo pacman -S godot blender freecad --noconfirm
#+end_src
* Audio, Video & Multimedia
** Photo Viewer & editor
#+begin_src bash
sudo pacman -S gimp krita inkscape --noconfirm
# sudo pacman -S gwenview --noconfirm
#+end_src
** Multimedia viewer & editor
#+begin_src bash
sudo pacman -S vlc elias kdenlive --noconfirm
# sudo pacman -S audacity lmms handbrake --noconfirm
#+end_src
* Virtual Machines & Containers
** Containers
#+begin_src bash
sudo pacman -S docker virtualbox vagrant --noconfirm
# sudo pacman -S lxc lxd --noconfirm
#+end_src
** Virtual Machines
#+begin_src bash
sudo pacman -S virtualbox vagarant --noconfirm
# sudo pacman -S virt-manager --noconfirm
#+end_src
* Office Utilities
#+begin_src bash
sudo pacman -S okular onlyoffice-desktopeditors --noconfirm
# sudo pacman -S dia --noconfirm
# sudo pacman -S skanlite --noconfirm
#+end_src
* Other Utilities
#+begin_src bash
sudo pacman -S spectacle uget gestures ventoy --noconfirm
#+end_src

#  LocalWords:  KDE Homebrew Lua
